app/controllers/project_ranks_controller.rb

INSERT INTO `project_ranks` (`project_id`, `msn_links`, `yahoo_links`, `page_rank`, `google_links`, `alexa_rank`, `created_at`) VALUES(NULL, NULL, 4444, 0, 333, 333, '2009-05-14 02:49:44')
SELECT * FROM `projects` WHERE (id = '1' ) LIMIT 1
---
  def create
    @project_rank = ProjectRank.new(params[:project_rank])
    @project_rank.project_id = @current_project.id
    @project_rank.save
    load_project_ranks if @project_rank.errors.empty?