app/controllers/projects_controller.rb

  def show
    @page_title = "#{ @current_project.url.capitalize } Dashboard"
    @tab = 'DASHBOARD'

    @last_rank = @current_project.last_rank
    @current_rank = @current_project.current_rank

    @recent_articles = @current_project.articles.find(:all, :order => "created_at DESC", :limit => 3)
---
SELECT * FROM `articles` WHERE (`articles`.project_id = 1) ORDER BY created_at DESC LIMIT 10